import numpy as np

a = np.arange(1, 9)
i = np.array([[0, 1], [2, 3]])

a[i] # array([[1, 2], [3, 4]])

#Только в этом случае индексы i должны
# определяться именно массивом NumPy,
# а не списком Python.

a = np.arange(1, 13).reshape(3, 4)
print(a)
indx = [2, 1, 0]
print(a[indx])

indx = np.array([[1, 0], [2, 1]])
print(a[indx])


i0 = [0, 1]
i1 = [1, 2]
a[i0, i1] # array([2, 7])
a[:, i1]
a[i0, 1] # array([2, 6])

a = np.arange(7) # array([0, 1, 2, 3, 4, 5, 6])
a[[0, 4, 6]] = [-1, -2, -3] # array([-1,  1,  2,  3, -2,  5, -3])
a[[0, 0, 0, 1]] = [1, 2, 3, 100] # array([  3, 100,   2,   3,  -2,   5,  -3])
a[[0, 0, 0]] = a[[0, 0, 0]] + 3
a[0] = a[0] + 3
a[[0, 0, 1, 2]] += 1 # array([  7, 101,  3,   3,  -2,   5,  -3])
a[[0, 1, 2]] += 1 # array([  7, 101,   3,   3,  -2,   5,  -3])
