import numpy as np


a = np.arange(12) # array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])
a[0] = 100 # первый элемент равен 100
b = a[2:4] # array([2, 3])
b[0] = -100

#Поэтому срезы – это не копии массивов, а лишь создание их нового представления. Это сделано специально для экономии памяти.

print(a[3:]) # array([ 3,  4,  5,  6,  7,  8,  9, 10, 11])
print(a[:5]) # array([ 100,    1, -100,   3,    4])
print(a[-5: -1]) # array([ 7,  8,  9, 10])
print(a[:]) # array([ 100,    1, -100,    3,   4,    5,    6,    7,    8,    9,   10,   11])
print(a[1:6:2]) # array([1, 3, 5])
print(a[::2]) # array([ 100, -100,    4,   6,    8,   10])
print(a[::-1])# array([  11,   10,    9,    8,    7,    6,    5,    4,    3, -100,  1,  100])
a[:4] = [-1, -2, -3, -4] # присваивание списка Python
a[4::2] = np.array([10, 20, 30, 40]) # присваивание массива NumPy

for x in a:
     print(x, sep=' ', end=' ')

x = np.array([(1, 2, 3), (10, 20, 30), (100, 200, 300)])
print([1, 1]) # значение 20
print(x[-1, -1]) # значение 300
print(x[0]) # array([1, 2, 3])
print(x[0, :]) # array([1, 2, 3])
print(x[:,1]) # array([  2,  20, 200])

for row in x:
    for val in row:
        print(val, end=' ')
    print()

for val in x.flat:
    print(val, end=' ')